scripts/artillery.yaml
config:
  target: "https://localhost:1234/api"
  environments:
    staging:
      target: "https://noipm-staging.herokuapp.com"
    ci:
      target: "https://noipm-ci.herokuapp.com"
  phases:
    - duration: 1
      arrivalRate: 5
      name: Warm up
    - duration: 1
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 3
      arrivalRate: 10
      name: Sustained load
  ensure:
    max: 400
    median: 30
    maxErrorRate: 1
scenarios:
  - name: 'Letter Generation'
    flow:
      - post:
          url: "/cases"
          json:
            case:
              complaintType: "Civilian Initiated"
              firstContactDate: "2020-07-22"
              intakeSourceId: 3
            civilian:
              firstName: "Tim"
              lastName: "Names"
              phoneNumber: "3147834127"
          capture:
            - json: "$.id"
              as: "caseId"
      - put:
          url: "/cases/{{ caseId }}/narrative"
          json:
            narrativeSummary: "a thing happened"
            narrativeDetails: "it was actually several things"
      # - post:
      #     url: "/cases/{{ caseId }}/case-tags"
      #     json:
      #       tagId: "apricots"
      - get:
          url: "/cases/{{ caseId }}/case-tags"
      - post:
          url: "/cases/{{ caseId }}/case-notes"
          json:
            actionTakenAt: "2021-06-15T13:57:00-05:00"
            caseNoteActionId: 4
            notes: "This happened"
            caseId: "{{ caseId }}"
            mentionedUsers:
              - name: "NOIPM Infra"
                value: "email@email.com"
      - get:
          url: "/cases/{{ caseId }}/case-notes"
      - post:
          url: "/cases/{{ caseId }}/cases-officers"
          json:
            officerId: 3400
            caseEmployeeType: "Officer"
            roleOnCase: "Accused"
          capture:
            - json: "$.accusedOfficers[0].id"
              as: "caseOfficerId"
      - post:
          url: "/cases/{{ caseId }}/case-officers/{{ caseOfficerId }}/officers-allegations"
          json:
            severity: "Low"
            details: "test"
            allegationId: 3286
      - put:
          url: "/cases/{{ caseId }}/status"
          json:
            status: "Letter in Progress"
      - get:
          url: "/cases/{{ caseId }}/referral-letter"
      - post:
          url: "/cases/{{ caseId }}/civilians"
          json:
            roleOnCase: "Complainant"
            caseId: "{{ caseId }}"
            civilianTitleId: 2
            genderIdentityId: 1
            raceEthnicityId: 3
            firstName: "Civilian"
            lastName: "Number One"